tutorials/fluidSolidInteraction/3dTubeRobin/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.02;

deltaT          2.5e-5;

writeControl    runTime;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

functions
{
    displacement
    {
        type            solidPointDisplacement;
        region          solid;
        point           (0 0.005 0.025);
    }
    solidForce
    {
        type           solidForces;
        historyPatch   inner-wall;
    }
    forces
    {
        type                forces;
        "libs|functionObjectLibs" ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             (wall);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 false;
        rhoInf              1000;
        CofR                (0.5 0.1 0);
        region              fluid;
    }
}

DebugSwitches
{
    elasticWallPressure  1;
}

// ************************************************************************* //
