tutorials/fluidSolidInteraction/3dTubeRobin/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       17200;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       17280;
    }
    inner-wall
    {
        type            wall;
        nFaces          1600;
        startFace       17360;
    }
    outer-wall
    {
        type            wall;
        nFaces          1600;
        startFace       18960;
    }
    symmetry-x
    {
        type            symmetryPlane;
        nFaces          320;
        startFace       20560;
    }
    symmetry-y
    {
        type            symmetryPlane;
        nFaces          320;
        startFace       20880;
    }
)


// ************************************************************************* //
