tutorials/fluidSolidInteraction/3dTubeRobin/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Link files for sonicLiquidFiles
#for file in $(find ./0 ./constant ./system -name '*.pimpleFluid')
#do 
#    ln -vnsf ${file##*/} ${file%.*}
#done

# Source solids4Foam scripts
source solids4FoamScripts.sh

# Check case version is correct
solids4Foam::convertCaseFormat .

# Create meshes
solids4Foam::runApplication -s solid blockMesh -region solid
solids4Foam::runApplication -s fluid blockMesh -region fluid

# Run solver
solids4Foam::runApplication solids4Foam
